---
kind: method
id: M:Autodesk.Revit.DB.Analysis.SystemsAnalysisOptions.Dispose
source: html/4708704d-db7e-7fde-b836-a986420cd32b.htm
---
# Autodesk.Revit.DB.Analysis.SystemsAnalysisOptions.Dispose Method

Releases all resources used by the SystemsAnalysisOptions

## Syntax (C#)
```csharp
public void Dispose()
```